; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-2-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p2-1 - location
	p2-3 - location
	p3-1 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at package1 s2)
	(at package2 s3)
	(at package3 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s2)
	(at truck1 s3)
	(at truck2 s2)
	(at package1 s1)
	(at package2 s3)
	(at package3 s2)
	))


)

; plan
1. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 2 of 7
2. (walk driver1 s3 p2-3)
   deleted: (at driver1 s3)
   added: (at driver1 p2-3)
   goals met: 2 of 7
3. (walk driver1 p2-3 s2)
   deleted: (at driver1 p2-3)
   added: (at driver1 s2)
   goals met: 3 of 7
4. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 3 of 7
5. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 7
6. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 3 of 7
7. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 3 of 7
8. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 2 of 7
9. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 3 of 7
10. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 3 of 7
11. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 4 of 7
12. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 5 of 7
13. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 5 of 7
14. (walk driver1 s3 p2-3)
   deleted: (at driver1 s3)
   added: (at driver1 p2-3)
   goals met: 5 of 7
15. (walk driver1 p2-3 s2)
   deleted: (at driver1 p2-3)
   added: (at driver1 s2)
   goals met: 6 of 7
16. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 7 of 7
